_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ОтражениеУслугГенподрядчикаЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_ОтражениеУслугГенподрядчикаЗаказчика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПринятыхРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьУслугГенподрядчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ВыполнениеРаботСубподрядчиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ВыполнениеРаботСубподрядчиком</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКС2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКС2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКС3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКС3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ОтражениеУслугГенподрядчикаЗаказчика/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата") Тогда
		Объект.Дата = Параметры.Дата;
		ПараметрДата = Параметры.Дата;
	КонецЕсли;	
	Если Параметры.Свойство("Соглашение") Тогда
		ПараметрСоглашение = Параметры.Соглашение;
	КонецЕсли;	
	Если Параметры.Свойство("Договор") Тогда
		ПараметрДоговор = Параметры.Договор;
	КонецЕсли;	
	Если Параметры.Свойство("Организация") Тогда
		ПараметрОрганизация = Параметры.Организация;
	КонецЕсли;	
	Если Параметры.Свойство("Контрагент") Тогда
		ПараметрКонтрагент = Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("Команда") Тогда
		ПараметрКоманда = СокрЛП(Параметры.Команда);
		Если ПараметрКоманда = "ЗаполнитьУслугиЗаказчика" Тогда
			ЭтаФорма.элементы.СтоимостьПринятыхРабот.Заголовок = "Стоимость реализованных работ";
			ЭтаФорма.Элементы.СтоимостьУслугГенподрядчика.Заголовок = "Стоимость услуг заказчика;";
		КонецЕсли;	
	КонецЕсли;
	Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗаМесяцНаСервере()
	
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(УСОERP_ВыполнениеРаботСубподрядчиком.СуммаСНДС) КАК СуммаСНДС
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком КАК УСОERP_ВыполнениеРаботСубподрядчиком
	|ГДЕ
	|	УСОERP_ВыполнениеРаботСубподрядчиком.ВидДвижения = &ВидДвижения
	|	И УСОERP_ВыполнениеРаботСубподрядчиком.Организация = &Организация
	|	И УСОERP_ВыполнениеРаботСубподрядчиком.Контрагент = &Контрагент
	|	И УСОERP_ВыполнениеРаботСубподрядчиком.ОбъектСтроительства = &ОбъектСтроительства";
	Текст = Текст + "
	|	И УСОERP_ВыполнениеРаботСубподрядчиком.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	ДатаЗапроса = Объект.Дата;
		
	Запрос.Текст =  Текст;
	
	Запрос.УстановитьПараметр("НачалоПериода",			ДатаЗапроса);
	Запрос.УстановитьПараметр("КонецПериода", 			ДатаЗапроса + 2592000);
	Запрос.УстановитьПараметр("Контрагент", 			ПараметрКонтрагент);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 			ПараметрОрганизация);
	Запрос.УстановитьПараметр("ВидДвижения", 			ВидДвиженияНакопления.Расход);
	
	Если ПараметрКоманда = "ЗаполнитьУслугиЗаказчика" Тогда
		Запрос.Текст	= СтрЗаменить(Запрос.Текст, "УСОERP_ВыполнениеРаботСубподрядчиком", "УСОERP_ВыполнениеРаботЗаказчика");
	КонецЕсли;	

	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаСНДС;
	КонецЕсли;
	
	Возврат 0;   
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЗаМесяц(Команда)
	флагЗаполнитьЗаМесяц = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщить(НСтр("ru='Не заполнено поле «Дата».'"));
		флагЗаполнитьЗаМесяц = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		
		Сообщить(НСтр("ru='Не заполнено поле «Объект строительства».'"));
		флагЗаполнитьЗаМесяц = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПроцентУслуг) Тогда
		Сообщить(НСтр("ru='Не заполнено поле «% Услуг».'"));
		флагЗаполнитьЗаМесяц = Ложь;
	КонецЕсли;
	
	Если флагЗаполнитьЗаМесяц Тогда
		
		Объект.СтоимостьПринятыхРабот 		= ЗаполнитьЗаМесяцНаСервере();
		Объект.СтоимостьУслугГенподрядчика	= (Объект.СтоимостьПринятыхРабот * Объект.ПроцентУслуг)/100;
		
		Объект.СуммаНДС	= ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СтоимостьУслугГенподрядчика, Объект.СтавкаНДС, Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	СтруктураПраметров = ОбъектСтроительстваПриИзмененииНаСервере(Объект.ОбъектСтроительства);
	Объект.НоменклатураУслуги	= СтруктураПраметров.Номенклатура;
	//Объект.СтавкаНДС	= СтруктураПраметров.СтавкаНДС; 
КонецПроцедуры

&НаСервере
Функция ОбъектСтроительстваПриИзмененииНаСервере(ОбъектСтроительства)
	Номенклатура	= ?(ЗначениеЗаполнено(ОбъектСтроительства), ?(ПараметрКоманда = "ЗаполнитьУслугиЗаказчика", ОбъектСтроительства.НоменклатураЗаказчика ,ОбъектСтроительства.НоменклатураГенподрядчика), Справочники.Номенклатура.ПустаяСсылка());
	
	СтавкаНДС	= Номенклатура.СтавкаНДС;
    СтруктураПраметров = Новый Структура;
	СтруктураПраметров.Вставить("Номенклатура", Номенклатура);
	СтруктураПраметров.Вставить("СтавкаНДС", СтавкаНДС);
	Возврат СтруктураПраметров;
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПередаваемыеЗначения = ЗаполнитьПередаваемыеЗначения();
	ЭтаФорма.Закрыть(ПередаваемыеЗначения);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПередаваемыеЗначения()
	 ПередаваемыеЗначения = Новый Структура;
	 ПередаваемыеЗначения.Вставить("Номенклатура", Объект.НоменклатураУслуги);
	 ПередаваемыеЗначения.Вставить("СуммаНДС",  Объект.СуммаНДС);
	 ПередаваемыеЗначения.Вставить("СуммаСНДС", Объект.СтоимостьУслугГенподрядчика - Объект.СуммаНДС);
	 ПередаваемыеЗначения.Вставить("СтавкаНДС", Объект.СтавкаНДС);
	 Возврат ПередаваемыеЗначения;
 КонецФункции	

&НаКлиенте
 Процедура НоменклатураУслугиПриИзменении(Элемент)
	 НоменклатураУслугиПриИзмененииНаСервере();
 КонецПроцедуры

&НаСервере
 Процедура НоменклатураУслугиПриИзмененииНаСервере()

 КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПринятыхРаботПриИзменении(Элемент)
	
	Попытка
		Объект.СтоимостьУслугГенподрядчика	= (Объект.СтоимостьПринятыхРабот * Объект.ПроцентУслуг)/100;
	Исключение
	КОнецПопытки;

	Объект.СуммаНДС	= ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СтоимостьУслугГенподрядчика, Объект.СтавкаНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентУслугПриИзменении(Элемент)
	
	Объект.СтоимостьУслугГенподрядчика	= (Объект.СтоимостьПринятыхРабот * Объект.ПроцентУслуг)/100;		
	Объект.СуммаНДС	= ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СтоимостьУслугГенподрядчика, Объект.СтавкаНДС, Истина);
	
КонецПроцедуры
